# ==========================================
# โจทย์ข้อที่ 4: ตัดเกรด 5 ระดับ
# Input: คะแนนสอบ (จำนวนเต็ม 0-100)
# Output: เกรด A, B, C, D หรือ F
# เงื่อนไข: >=80 ได้ A | >=70 ได้ B | >=60 ได้ C | >=50 ได้ D | น้อยกว่า 50 ได้ F
# ==========================================


# นักเรียนเขียนโค้ดต่อจากบรรทัดนี้
score = int(input())
if score >= 80:
    print("ได้ A")
elif score >= 70:
    print("ได้ B")
elif score >= 60:
    print("ได้ C")
elif score >= 50:
    print("ได้ D")
else:
    print("ได้ F")
